app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT `posts`.* FROM `posts`

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `comments`, `user_id`, `created_at`, `updated_at`) VALUES ('123', 'ffgfgfg', 1, '2016-10-13 15:04:44', '2016-10-13 15:04:44')

    def set_post
      @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1