app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def create
    @task = current_user.posts.build(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`title`, `comments`, `status`, `estimation`, `start_date`, `due_date`, `created_at`, `updated_at`) VALUES ('1', '1', 0, 3, '2015-05-03', '2016-10-13', '2016-10-13 20:36:07', '2016-10-13 20:36:07')

    def set_task
      @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = NULL LIMIT 1